app/views/listings/_display.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
---
            <p>Contact: <%= listing.contact %></p>
            <p>Owner: <%= listing.user.first_name%> <%= listing.user.last_name%></p>