app/views/listings/edit.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
---
      <div class="card-body" style = " padding: 2%" >
        <h3>Hi, <%= @listing.user.first_name%> <%= @listing.user.last_name%>!</h3>