app/views/listings/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
---
            <p><strong>Country: </strong><%= @listing.country %></p>
            <p><strong>Owner: </strong><%= @listing.user.first_name%> <%= @listing.user.last_name%></p>