app/controllers/listings_controller.rb

  def index
    @listings = Listing.all
---
SELECT "listings".* FROM "listings"

  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id
      if @listing.save
---
INSERT INTO "listings" ("user_id", "country", "location", "title", "description", "speciality", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @listing.update(listing_params)
---
UPDATE "listings" SET "country" = $1, "location" = $2, "updated_at" = $3 WHERE "listings"."id" = $4  [["country", "South Africa"], ["location", "Welkom"], ["updated_at", "2018-03-24 14:10:53.855126"], ["id", 6]]

  def destroy
    @listing.destroy
---
DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 1]]

  def search
    @listings =  Listing.all
      filtering_params(params).each do |key,value|
        @listings = @listings.public_send(key, value) if value.present?
---
SELECT "listings".* FROM "listings" WHERE (country ILIKE '%malaysia%') AND (location ILIKE '%kuala lumpur%')
SELECT  1 AS one FROM "listings" WHERE (country ILIKE '%malaysia%') AND (location ILIKE '%kuala lumpur%') LIMIT $1  [["LIMIT", 1]]

  def set_listing
    @listing = Listing.find(params[:id])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]