app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "sza@example.com"], ["LIMIT", 1]]
---
  def create
    reset_session
    @user = User.find_by(email: params[:email])

SELECT  "authentications".* FROM "authentications" WHERE "authentications"."provider" = $1 AND "authentications"."uid" = $2 LIMIT $3  [["provider", "google_oauth2"], ["uid", "110759738876999030104"], ["LIMIT", 1]]
UPDATE "authentications" SET "token" = $1, "updated_at" = $2 WHERE "authentications"."id" = $3
---
  def create_from_omniauth
  auth_hash = request.env["omniauth.auth"]
  authentication = Authentication.find_by_provider_and_uid(auth_hash["provider"], auth_hash["uid"]) ||  Authentication.create_with_omniauth(auth_hash)

      # if: previously already logged in with OAuth
      if authentication.user
        user = authentication.user
        authentication.update_token(auth_hash)