app/controllers/users_controller.rb

  def create
    p params
    @user = User.new(user_params)
    if @user.save!
---
INSERT INTO "users" ("created_at", "updated_at", "password_digest", "first_name", "last_name", "email") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"